# St7GetGlobalStringValue

Returns a global string, which is internal to the Strand7 application.

long St7GetGlobalStringValue(long Index, char* Value, long MaxStringLen)
Input Parameters
Index
Index Notes
svInfluenceCombinationLog Full filename with path of the load influence combination log file
generated by calling St7GenerateInfluenceCases.
MaxStringLen
Amount of space allocated to Value.
Output Parameters
Value
Global string state variable.